---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.Railing
zh: 栏杆
source: html/fde9e5a0-4df9-9fa0-93bc-c945bfc78618.htm
---
# Railing Methods

**中文**: 栏杆

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.